// - Нам дано масив друзів

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

// Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
// Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

if (friends.length >= 3) {
    console.log('Big array');
} else {
    console.log('Small array');
}

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
// Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

const num1 = +prompt('Enter first number');
const num2 = +prompt('Enter second number');
const num3 = +prompt('Enter third number');

if (num1 > num2) {
    if (num2 > num3) {
        console.log(num2);
    } else {
        console.log(num3);
    }
} else {
    if (num1 > num3) {
        console.log(num1 + ' - перше число знаходиться між двома іншими');
    } else {
        console.log(num3);
    }
}

// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//     result = 'Мало';
// } else {
//     result = 'Багато';
// }

const a = +prompt('Enter "a" value');
const b = +prompt('Enter "b" value');

a + b < 4 ? console.log('Мало') : console.log('Багато');

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

const num4 = +prompt('Enter some number from -100 to 100');
num4 < 0 ? console.log('негативне число') : num4 === 0 ? console.log('нуль') : console.log('позитивне число');

// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test = true;

if (test) {
    console.log('Вірно');
} else {
    console.log('Неправильно');
}

test ? console.log('Вірно') : console.log('Неправильно');

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

const answer = prompt('Яка «офіційна» назва JavaScript?');

answer === 'ECMAScript' ? console.log('Правильно!') : console.log('Не знаєте? ECMAScript!');

// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

const apartment = +prompt('Введи номер квартири');

if (apartment >= 1 && apartment <= 20) {
    console.log('I під\'їзд');
} else if (apartment >= 21 && apartment <= 48) {
    console.log('II під\'їзд');
} else if (apartment >= 49 && apartment <= 90) {
    console.log('III під\'їзд');
} else {
    console.log('Неправильний номер квартири');
}

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

const num5 = +prompt('Введи будь яке число');

num5 === 10 ? console.log('ВІРНО') : console.log('НЕВІРНО');

// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

const temperature = +prompt('Скільки градусів на вулиці?');

temperature >= 10 && temperature <= 22 ? console.log('ми йдемо ВЧИТИСЯ') : console.log('сидимо вдома і вчимося ОНЛАЙН');

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

const num6 = +prompt('Введи число від 1 до 5');

switch (num6) {
    case 1:
        console.log('Ви виграли Авто!');
        break;
    case 2:
        console.log('Ви виграли Мотоцикл!');
        break;
    case 3:
        console.log('Ви виграли Телефон!');
        break;
    case 4:
        console.log('Ви виграли Телевізор!');
        break;
    case 5:
        console.log('Ви виграли Годинник!');
        break;
    default:
        console.log('Ви ввели невірне число');
}
